# Camera Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Camera Constructor
Camera Class See Also
---
Camera
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Camera(
	Camera other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As Camera _
)
```

Visual C++
---
```text
public:
Camera(
	Camera^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.DirectContext3D..::..Camera
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace